local bot = {
			["Name"] = "Неистовство",
			["Buttons"] = {
				[1] = {
					Type = "trigger",
					Icon = "Interface\\Icons\\ABILITY_SEAL",
					Name = "Stop",
				},
				[2] = {
					Type = "trigger",
					Icon = "Interface\\ICONS\\Inv_Misc_SummerFest_BrazierRed.blp",
					Name = "Burst",
				},
			},
			["Id"] = 2,
			["Spells"] = {
				["Вихрь"] = 190411,
				["Удар громовержца"] = 107570,
				["Яростный выпад"] = 85288,
				["Рев дракона"] = 118000,
				["Неистовый удар сплеча"] = 100130,
				["Буйство"] = 184367,
				["Кровожадность"] = 23881,
			},
			["Class"] = "WARRIOR",
			["Buffs"] = {
				["Рывок"] = 105771,
				["Удар громовержца"] = 132169,
				["Вкус крови"] = 206333,
				["Кровавый фарш"] = 85739,
				["Камень Шаманов: Дух Волка"] = 155347,
				["Бешенство"] = 202539,
				["Пушечное ядро"] = 215570,
				["Исступление"] = 184362,
				["Яростный рывок"] = 202225,
			},
			["Talents"] = {
				["Кровавая баня"] = 22395,
				["Удар громовержца"] = 22372,
				["Рев дракона"] = 16037,
				["Резня"] = 19140,
				["Удвоенное время"] = 22409,
				["Вихрь клинков"] = 22405,
				["Ударная волна"] = 22374,
				["Военная машина"] = 22632,
				["Предельный шаг"] = 22627,
				["Вспышка"] = 22381,
				["Разъяренный берсерк"] = 22391,
				["Бесконечная ярость"] = 22633,
				["Аватара"] = 19138,
				["Кровопролитие"] = 22384,
				["Бешенство"] = 22544,
				["Яростный рывок"] = 22635,
				["Боевая раскраска"] = 22382,
				["Пушечное ядро"] = 22379,
				["Безудержная энергия"] = 22402,
				["Внутренняя ярость"] = 22400,
				["Свежее мясо"] = 22491,
			},
		}
		
function bot:OnUpdate(g, list, modes)
	if IsMounted() then return end	
	if modes.toggle.Stop then 
		return
	end
	list:Cast( "Неистовый удар сплеча", g.target:Talent("Бешенство"):CanUse("Неистовый удар сплеча"):Aura("Бешенство", "mine", "self", "inverse"):Best() )	
	list:Cast( "Неистовый удар сплеча", g.target:Talent("Бешенство"):CanUse("Неистовый удар сплеча"):Aura("Бешенство", "mine", "self", {time=2, bound="<"}):Best() )
	
	
	list:Cast( "Буйство", g.target:CanUse("Буйство"):Best() )
	list:Cast( "Яростный выпад", g.target:CanUse("Яростный выпад"):Best() )
	
	list:Cast( "Кровожадность", g.target:CanUse("Кровожадность"):Best() )
	list:Cast( "Вихрь", g.player:CanUse("Вихрь"):Aura("Пушечное ядро", "mine", "self"):Best() )				
	list:Cast( "Неистовый удар сплеча", g.target:CanUse("Неистовый удар сплеча"):Best() )
	
	return list:Execute()
end

		
TBRegister(bot)


