local bot = {
			["Talents"] = {
				["Рогатые гремучие змеи"] = 22274,
				["Залп"] = 22287,
				["Коварный выстрел"] = 22288,
				["Быстрая реакция"] = 19347,
				["Странник"] = 19348,
				["Часовой"] = 22286,
				["Стая воронов"] = 19357,
				["Верная цель"] = 22498,
				["На изготовку!"] = 22495,
				["Шквал"] = 22002,
				["Укус виверны"] = 22276,
				["Связующий выстрел"] = 22284,
				["Разрывной выстрел"] = 22267,
				["Пронзающий выстрел"] = 22308,
				["Одинокий волк"] = 22279,
				["Камуфляж"] = 22499,
				["Черная стрела"] = 22497,
				["Устойчивая концентрация"] = 22501,
				["Терпеливый снайпер"] = 21998,
				["Порыв"] = 22318,
			},
			["Name"] = "Стрельба",
			["Buttons"] = {
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\ABILITY_SEAL",
					["Name"] = "Stop",
				}, -- [1]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\Ability_Warrior_Bladestorm",
					["Name"] = "AoE",
				}, -- [2]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\ICONS\\Inv_Misc_SummerFest_BrazierRed.blp",
					["Name"] = "Burst",
				}, -- [3]
			},
			["Id"] = 2,
			["Spells"] = {
				["Прицельный залп"] = 185901,
				["Стая воронов"] = 131894,
				["Залп"] = 2643,
				["Чародейский выстрел"] = 185358,
				["Взрывной выстрел"] = 186387,
				["Автоматическая стрельба"] = 75,
				["Прицельный выстрел"] = 19434,
			},
			["Class"] = "HUNTER",
			["Buffs"] = {
				["Эхо мучений"] = 194608,
				["Уязвимость"] = 187131,
				["Метка охотника"] = 185365,
				["Камень Шаманов: Дух Волка"] = 155347,
				["Знак посланника"] = 186404,
				["Коварный выстрел"] = 227272,
				["Указание на цели"] = 223138,
			},
		}
		
function bot:OnUpdate(g, list, modes)
	if IsMounted() then return end	
	if modes.toggle.Stop then 
		return
	end

	list:Cast( "Стая воронов", g.target:CanUse("Стая воронов"):Best() )	

	list:Cast( "Прицельный выстрел", g.target:CanUse("Прицельный выстрел"):Aura("Уязвимость", "mine", {time=2, bound=">"}):Best() )		
	
	list:Cast( "Прицельный залп", g.target:CanUse("Прицельный залп"):Aura("Уязвимость", "mine", "inverse", {time=2, bound=">"}):Energy(">", 100):Best() )		

	list:Cast( "Прицельный выстрел", g.target:Talent("Терпеливый снайпер"):CanUse("Прицельный выстрел"):Energy(">", 130):LastCast("Прицельный выстрел", false, "total"):Best() )	
	
	list:Cast( "Залп", g.target:CanUse("Залп"):Toggle("AoE"):Best() )
	list:Cast( "Чародейский выстрел", g.target:CanUse("Чародейский выстрел"):Best() )	
	
	return list:Execute()
end

		
TBRegister(bot)