local bot = {
			["Talents"] = {
				["Улучшенные зловещие охотники"] = 21694,
				["Темный пакт"] = 19288,
				["Надвигающийся рок"] = 22045,
				["Стремительный бег"] = 19291,
				["Темное воодушевление"] = 22038,
				["Демонический заряд"] = 22479,
				["Жатва душ"] = 22046,
				["Демонический круг"] = 22047,
				["Имплозия"] = 22089,
				["Призыв созерцателя Тьмы"] = 22478,
				["Гримуар служения"] = 19294,
				["Гримуар верховной власти"] = 21182,
				["Посредник душ"] = 19293,
				["Длань судьбы"] = 22477,
				["Гримуар синергии"] = 21717,
				["Неистовство Тьмы"] = 19286,
				["Разделение силы"] = 22042,
				["Демонический зов"] = 22041,
				["Шкура демона"] = 19280,
				["Лик тлена"] = 19285,
				["Пламя Тьмы"] = 22036,
			},
			["Name"] = "Демонология",
			["Buttons"] = {
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\ABILITY_SEAL",
					["Name"] = "Stop",
				}, -- [1]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\Ability_Warrior_Bladestorm",
					["Name"] = "AoE",
				}, -- [2]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\ICONS\\Inv_Misc_SummerFest_BrazierRed.blp",
					["Name"] = "Burst",
				}, -- [3]
			},
			["Id"] = 2,
			["Spells"] = {
				["Демоническое усиление"] = 193396,
				["Стрела Тьмы"] = 686,
				["Рок"] = 603,
				["Жизнеотвод"] = 1454,
				["Рука Гул'дана"] = 105174,
				["Призыв зловещих охотников"] = 104316,
				["Похищение жизни"] = 689,
			},
			["Class"] = "WARLOCK",
			["Buffs"] = {
				["Защитник Стражей Хиджала"] = 93341,
				["Ливень шлака"] = 177083,
				["Камень Шаманов: Дух Волка"] = 155347,
				["Расплавленный металл"] = 177081,
				["Поглощение души"] = 108366,
				["Темное воодушевление"] = 196606,
			},
		}
		
function bot:OnUpdate(g, list, modes)
	if IsMounted() then return end	
	if modes.toggle.Stop then 
		return
	end
	list:Cast( "Демоническое усиление", g.player:CanUse("Демоническое усиление"):LastCast("Призыв зловещих охотников", true):Best() )	
	
	list:Cast( "Рок", g.target:CanUse("Рок"):Aura("Рок", "mine", "inverse"):Best() )
	list:Cast( "Призыв зловещих охотников", g.target:CanUse("Призыв зловещих охотников"):Best() )	
	
	list:Cast( "Рука Гул'дана", g.target:CanUse("Рука Гул'дана"):SoulShards(4):LastCast("Рука Гул'дана", false):Best() )	

	list:Cast( "Жизнеотвод", g.player:CanUse("Жизнеотвод"):Mana("<", 60):Best() )	
	
	list:Cast( "Похищение жизни", g.target:CanUse("Похищение жизни"):HP("<", 70, "self"):Best() )	

	list:Cast( "Стрела Тьмы", g.target:CanUse("Стрела Тьмы"):Best() )	
	
	return list:Execute()
end

		
TBRegister(bot)