local bot = {
			["Talents"] = {
				["Ба-бах!"] = 22465,
				["Контролируемое горение"] = 22468,
				["Метеор"] = 21633,
				["Плавучая льдина"] = 22446,
				["Поджигатель"] = 22462,
				["Огненный след"] = 22472,
				["Нестабильная магия"] = 22449,
				["Ледяной заслон"] = 22471,
				["Холодная хватка"] = 16025,
				["Зеркальное изображение"] = 22444,
				["Кольцо мороза"] = 22448,
				["Вихрь углей"] = 22220,
				["Живая бомба"] = 22451,
				["Взрывная волна"] = 22450,
				["Колдовской поток"] = 22447,
				["Руна мощи"] = 22445,
				["Воспламенение"] = 22459,
				["Пироманьяк"] = 22456,
				["Разжигание"] = 21631,
				["Прижигание"] = 22443,
				["Мерцание"] = 22442,
			},
			["Name"] = "Огонь",
			["Buttons"] = {
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\ABILITY_SEAL",
					["Name"] = "Stop",
				}, -- [1]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\Ability_Warrior_Bladestorm",
					["Name"] = "AoE",
				}, -- [2]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\ICONS\\Inv_Misc_SummerFest_BrazierRed.blp",
					["Name"] = "Burst",
				}, -- [3]
			},
			["Id"] = 2,
			["Spells"] = {
				["Ледяная преграда"] = 11426,
				["Дыхание дракона"] = 31661,
				["Ба-бах!"] = 205029,
				["Огненный шар"] = 133,
				["Вихрь углей"] = 198929,
				["Метеор"] = 153561,
				["Ледяная глыба"] = 45438,
				["Антимагия"] = 2139,
				["Возгорание"] = 190319,
				["Кольцо льда"] = 122,
				["Огненная глыба"] = 11366,
				["Живая бомба"] = 44457,
				["Ожог"] = 2948,
				["Руна мощи"] = 116011,
				["Огненный взрыв"] = 108853,
				["Зеркальное изображение"] = 55342,
				["Скачок"] = 1953,
				["Огненный столб"] = 2120,
				["Чарокрад"] = 30449,
			},
			["Buffs"] = {
				["Горящий метеор"] = 155158,
				["Защитник Стражей Хиджала"] = 93341,
				["Живая бомба"] = 217694,
				["Гипотермия"] = 41425,
				["Колдовской поток"] = 116267,
				["Руна мощи"] = 116014,
				["Воспламенение"] = 12654,
				["Критический удар"] = 165832,
				["Путь огня"] = 48108,
				["Знак рока"] = 184073,
				["Разогрев"] = 48107,
			},
			["Class"] = "MAGE",
		}

function bot:OnUpdate(g, list, modes)
	if IsMounted() then return end
	if modes.toggle.Stop then
		return
	end



  list:Cast( "Антимагия", g.target:CanUse("Антимагия"):CanInterrupt():Best() )


	return list:Execute()
end


TBRegister(bot)
