local bot = {
			["Talents"] = {
				["Одинокая зима"] = 22460,
				["Пробирающий холод"] = 22463,
				["Раскалывающийся лед"] = 22469,
				["Кольцо обледенения"] = 22452,
				["Плавучая льдина"] = 22446,
				["Буря комет"] = 21634,
				["Нестабильная магия"] = 22449,
				["Морозный луч"] = 22457,
				["Холодная хватка"] = 16025,
				["Зеркальное изображение"] = 22444,
				["Кольцо мороза"] = 22448,
				["Арктическая буря"] = 22473,
				["Ледяной заслон"] = 22471,
				["Ледовый шип"] = 22309,
				["Колдовской поток"] = 22447,
				["Руна мощи"] = 22445,
				["Мерцание"] = 22442,
				["Ледяная бомба"] = 22454,
				["Морозное касание"] = 22466,
				["Ледяная Бездна"] = 21632,
				["Прижигание"] = 22443,
			},
			["Name"] = "Лед",
			["Buttons"] = {
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\ABILITY_SEAL",
					["Name"] = "Stop",
				}, -- [1]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\Ability_Warrior_Bladestorm",
					["Name"] = "AoE",
				}, -- [2]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\ICONS\\Inv_Misc_SummerFest_BrazierRed.blp",
					["Name"] = "Burst",
				}, -- [3]
			},
			["Id"] = 3,
			["Spells"] = {
				["Ледяная преграда"] = 11426,
				["Ледяное копье"] = 30455,
				["Кольцо обледенения"] = 157997,
				["Буря комет"] = 153595,
				["Морозное касание"] = 205030,
				["Ледяная бомба"] = 112948,
				["Конус холода"] = 120,
				["Снежная буря"] = 190356,
				["Морозный луч"] = 205021,
				["Антимагия"] = 2139,
				["Зеркальное изображение"] = 55342,
				["Кольцо льда"] = 122,
				["Мерцание"] = 212653,
				["Скачок"] = 1953,
				["Ледяной шар"] = 84714,
				["Стылая кровь"] = 12472,
				["Руна мощи"] = 116011,
				["Шквал"] = 44614,
				["Плавучая льдина"] = 108839,
				["Ледяная глыба"] = 45438,
				["Ледовый шип"] = 199786,
				["Ледяная стрела"] = 116,
			},
			["Buffs"] = {
				["Заморозка мозгов"] = 190446,
				["Окоченение"] = 205708,
				["Гипотермия"] = 41425,
				["Знак рока"] = 184073,
				["Кристаллы льда"] = 205473,
				["Критический удар"] = 165832,
				["Шквал_"] = 228358,
				["Сильная струя воды"] = 135029,
				["Морозный луч"] = 208166,
				["Шквал"] = 228354,
				["Ледяная стрела"] = 59638,
				["Ледовый шип"] = 228600,
				["Колдовской поток"] = 116267,
				["Руна мощи"] = 116014,
				["Ледовый шип!"] = 199844,
				["Ледяные пальцы"] = 44544,
				["Пробирающий холод"] = 205766,
				["Морозный луч_"] = 208141,
				["Защитник Стражей Хиджала"] = 93341,
			},
			["Class"] = "MAGE",
		}

function bot:OnUpdate(g, list, modes)
	if IsMounted() then return end
	if modes.toggle.Stop then
		return
	end



  list:Cast( "Антимагия", g.target:CanUse("Антимагия"):CanInterrupt():Best() )


	return list:Execute()
end


TBRegister(bot)
