local bot = {
			["Talents"] = {
				["Леденящие ветра"] = 22446,
				["Одинокая зима"] = 22460,
				["Пробирающий холод"] = 22463,
				["Арктическая буря"] = 22473,
				["Кольцо обледенения"] = 22452,
				["Плавучая льдина"] = 22903,
				["Ледяные осколки"] = 22469,
				["Мерцание"] = 22442,
				["Морозный луч"] = 22457,
				["Зеркальное изображение"] = 22444,
				["Кольцо мороза"] = 22448,
				["Буря комет"] = 21634,
				["Ледяной заслон"] = 22471,
				["Ледовый шип"] = 22309,
				["Колдовской поток"] = 22447,
				["Руна мощи"] = 22445,
				["Ледяная изоляция"] = 16025,
				["Ледяная бомба"] = 22454,
				["Нестабильная магия"] = 22449,
				["Ледяная Бездна"] = 21632,
				["Морозное касание"] = 22466,
			},
			["Name"] = "Лед",
			["Id"] = 3,
			["Spells"] = {
				["Конус холода"] = 120,
				["Ледяная преграда"] = 11426,
				["Ледяное копье"] = 30455,
				["Антимагия"] = 2139,
				["Шквал"] = 44614,
				["Кольцо обледенения"] = 157997,
				["Ледяной шар"] = 84714,
				["Ледяная бомба"] = 112948,
				["Ледяная стрела"] = 116,
				["Ледовый шип"] = 199786,
				["Руна мощи"] = 116011,
				["Стылая кровь"] = 12472,
				["Буря комет"] = 153595,
				["Снежная буря"] = 190356,
			},
			["Buffs"] = {
				["Заморозка мозгов"] = 190446,
				["Окоченение"] = 205708,
				["Пробирающий холод"] = 205766,
				["Защитник Стражей Хиджала"] = 93341,
				["Кристаллы льда"] = 205473,
				["Критический удар"] = 165832,
				["Сильная струя воды"] = 135029,
				["Конус холода"] = 212792,
				["Видение Бездны"] = 201410,
				["Шквал"] = 228354,
				["Зимняя стужа"] = 228358,
				["Ледовый шип"] = 228600,
				["Колдовской поток"] = 116267,
				["Руна мощи"] = 116014,
				["Ледовый шип!"] = 199844,
				["Ледяные пальцы"] = 44544,
			},
			["Class"] = "MAGE",
			["Buttons"] = {
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\ABILITY_SEAL",
					["Name"] = "Stop",
				}, -- [1]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\Ability_Warrior_Bladestorm",
					["Name"] = "AoE",
				}, -- [2]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\ICONS\\Inv_Misc_SummerFest_BrazierRed.blp",
					["Name"] = "Burst",
				}, -- [3]
				{
					Type = "spell",
					Spell = 11426, -- Ледяная преграда
				},
			},
			["Macro"] = {
				--["selfFS"] = "/cast [@player] Огненный столб",
			--	["selfMet"] = "/cast [@player] Метеор",
			},
		}


		function bot:OnUpdate(g, list, modes)
			if IsMounted() then return end
			if modes.toggle.Stop then
				return
			end


		  list:Cast( "Антимагия", g.target:CanUse("Антимагия"):CanInterrupt("first"):Best() )

			list:Cast( "Ледяное копье", g.target:CanUse("Ледяное копье"):Aura("Зимняя стужа", "mine"):Best() )
			list:Cast( "Ледяное копье", g.target:CanUse("Ледяное копье"):Aura("Ледяные пальцы", "mine", "self"):Best() )

			list:Cast( "Ледяная преграда", g.player:CanUse("Ледяная преграда"):Enabled("Ледяная преграда"):Aura("Ледяная преграда", "mine", "self", "inverse"):Best() )

			list:Cast( "Шквал", g.target:CanUse("Шквал"):Aura("Заморозка мозгов", "mine", "self"):Best() )

			list:Cast( "Ледовый шип", g.target:CanUse("Ледовый шип"):Best() )
			list:Cast( "Ледяная стрела", g.target:CanUse("Ледяная стрела"):Best() )

			return list:Execute()
		end


		TBRegister(bot)
