local bot = {
			["Talents"] = {
				["Последнее прибежище"] = 22543,
				["Пламенное приземление"] = 22541,
				["Трещина"] = 22509,
				["Взрывная душа"] = 22768,
				["Удар Бездны"] = 22502,
				["Печать цепей"] = 22510,
				["Отражение клинков"] = 22513,
				["Пиршество душ"] = 22505,
				["Кормление демона"] = 22508,
				["Пламенная боль"] = 22503,
				["Клинок Скверны"] = 22324,
				["Ускоренные печати"] = 22511,
				["Сожжение заживо"] = 22507,
				["Раздирание души"] = 22770,
				["Средоточие печатей"] = 22546,
				["Призрачный барьер"] = 21902,
				["Демоническое насыщение"] = 22548,
				["Опустошение Скверны"] = 22512,
				["Бритвенно-острые шипы"] = 22504,
				["Жаркий выброс"] = 22766,
				["Извержение Скверны"] = 22540,
			},
			["Name"] = "Месть",
			["Id"] = 2,
			["Spells"] = {
				["Жар преисподней"] = 178740,
				["Призрачное зрение"] = 188501,
				["Иссечение"] = 203782,
				["Огненное клеймо"] = 204021,
				["Мучение"] = 185245,
				["Печать огня"] = 204596,
				["Демонические шипы"] = 203720,
				["Поглощение магии"] = 183752,
				["Раскалывание душ"] = 228477,
				["Бросок боевого клинка"] = 204157,
				["Метаморфоза"] = 187827,
			},
			["Class"] = "DEMONHUNTER",
			["Buffs"] = {
				["Огненное клеймо"] = 207744,
				["Печать огня"] = 204598,
				["Демонические шипы"] = 203819,
				["Фрагменты души"] = 203981,
				["Демоническая свирепость"] = 226991,
			},
      ["Buttons"] = {
        {
          Type = "trigger",
          Icon = "Interface\\Icons\\ABILITY_SEAL",
          Name = "Stop",
        },
        {
          Type = "trigger",
          Icon = "Interface\\Icons\\Ability_Warrior_Bladestorm",
          Name = "AoE",
        },
      },
		}

function bot:OnUpdate(g, list, modes)
	if IsMounted() then return end
	if modes.toggle.Stop then
		return
	end

	list:Cast( "Демонические шипы", g.player:CanUse("Демонические шипы"):Charges("Демонические шипы", 2, 1):Aura("Демонические шипы", "mine", "self", "inverse"):Condition(g.target:InSpellRange("Раскалывание душ"):Any()):Best() )
	list:Cast( "Раскалывание душ", g.target:CanUse("Раскалывание душ"):Pain(100):Best() )

	list:Cast( "Поглощение магии", g.target:CanUse("Поглощение магии"):CanInterrupt("first"):Best() )
  list:Cast( "Жар преисподней", g.player:CanUse("Жар преисподней"):Condition(g.target:InSpellRange("Раскалывание душ"):Any()):Best() )
  list:Cast( "Иссечение", g.target:CanUse("Иссечение"):Best() )
  list:Cast( "Бросок боевого клинка", g.target:CanUse("Бросок боевого клинка"):Best() )

	return list:Execute()
end


TBRegister(bot)
