local bot = {
			["Talents"] = {
				["Родство с исцелением"] = 22159,
				["Острые колючки"] = 22419,
				["Массовое оплетение"] = 18576,
				["Душа леса"] = 21709,
				["Родство с силой зверя"] = 22156,
				["Кровавое бешенство"] = 22420,
				["Хранитель земли"] = 22423,
				["Раздавить"] = 22425,
				["Родство с балансом"] = 22163,
				["Яростное разрывание"] = 22426,
				["Стремительный рывок"] = 18571,
				["Галактический страж"] = 22421,
				["Астральный скачок"] = 18570,
				["Воплощение: Страж Урсока"] = 21706,
				["Гортанный рык"] = 22424,
				["Мощное оглушение"] = 21778,
				["Лунный луч"] = 22427,
				["Колючий мех"] = 22418,
				["Выживает сильнейший"] = 22422,
				["Страж Элуны"] = 21712,
				["Тайфун"] = 18577,
			},
			["Name"] = "Страж",
			["Buttons"] = {
				[1] = {
					Type = "trigger",
					Icon = "Interface\\Icons\\ABILITY_SEAL",
					Name = "Stop",
				},
				[2] = {
					Type = "trigger",
					Icon = "Interface\\Icons\\Ability_Warrior_Bladestorm",
					Name = "AoE",
				},
			},
			["Id"] = 3,
			["Spells"] = {
				["Метка Урсола"] = 192083,
				["Массовое оплетение"] = 102359,
				["Неистовое восстановление"] = 22842,
				["Лунный огонь"] = 8921,
				["Целительное прикосновение"] = 5185,
				["Снятие порчи"] = 2782,
				["Облик медведя"] = 5487,
				["Взбучка"] = 77758,
				["Трепка"] = 6807,
				["Железный мех"] = 192081,
				["Размах"] = 213771,
				["Увечье"] = 33917,
				["Раздавить"] = 80313,
				["Лобовая атака"] = 106839,
			},
			["Buffs"] = {
				["Обездвиживание"] = 45334,
				["Лунный огонь"] = 164812,
				["Камень Шаманов: Дух Волка"] = 155347,
				["Хранитель земли"] = 203975,
				["Страж Элуны"] = 213680,
				["Взбучка"] = 192090,
				["Знак Призрачной Луны"] = 159678,
				["Защитник гильдии"] = 97341,
				["Training Gear"] = 182422,
				["Увечье!"] = 93622,
				["Раздавить"] = 158792,
			},
			["Class"] = "DRUID",
		}

function bot:OnUpdate(g, list, modes)
	if IsMounted() then return end
	if modes.toggle.Stop then
		return
	end

	list:Cast( "Лобовая атака", g.target:CanUse("Лобовая атака"):CanInterrupt():Best() )

	if g.player:AffectingCombat(true):MinHP() then
		list:Cast( "Железный мех", g.player:CanUse("Железный мех"):Energy(">", 80):Best() )
		list:Cast( "Неистовое восстановление", g.player:CanUse("Неистовое восстановление"):Charges("Неистовое восстановление",2,1):HP("<", 90, "self"):Best() )
		list:Cast( "Неистовое восстановление", g.player:CanUse("Неистовое восстановление"):Charges("Неистовое восстановление",2,5):HP("<", 80, "self"):Best() )
		list:Cast( "Неистовое восстановление", g.player:CanUse("Неистовое восстановление"):Charges("Неистовое восстановление",2,10):HP("<", 70, "self"):Best() )
		list:Cast( "Неистовое восстановление", g.player:CanUse("Неистовое восстановление"):HP("<", 50, "self"):Best() )
	end

	list:Cast( "Увечье", g.target:CanUse("Увечье"):Best() )
	list:Cast( "Раздавить", g.target:CanUse("Раздавить"):Best() )
	list:Cast( "Взбучка", g.target:CanUse("Взбучка"):InSpellRange("Увечье"):Best() )
	list:Cast( "Лунный огонь", g.target:CanUse("Лунный огонь"):Aura("Лунный огонь", "mine", "inverse"):Best() )
	list:Cast( "Размах", g.target:CanUse("Размах"):InSpellRange("Увечье"):Best() )


	return list:Execute()
end


TBRegister(bot)
