local bot = {
			["Talents"] = {
				["Порыв нефритового ветра"] = 20184,
				["Волна ци"] = 19820,
				["Отвар Черного Быка"] = 19992,
				["Выброс ци"] = 20185,
				["Серия нокаутов"] = 22108,
				["Целебный эликсир"] = 23363,
				["Глаз тигра"] = 23106,
				["Ци-полет"] = 19818,
				["Взмах тигрового хвоста"] = 19993,
				["Круг мира"] = 19995,
				["Подвижность"] = 19304,
				["Призыв Нюцзао, Черного Быка"] = 22103,
				["Смягчение удара"] = 20175,
				["Высокая стойкость"] = 22106,
				["Тигриное рвение"] = 19302,
				["Упрощенное варение"] = 22099,
				["Защита"] = 22104,
				["Призыв статуи Черного Быка"] = 19994,
				["Огнеполох"] = 22097,
				["Корпусом работай!"] = 20174,
				["Особая доставка"] = 19819,
			},
			["Name"] = "Хмелевар",
			["Buttons"] = {
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\ABILITY_SEAL",
					["Name"] = "Stop",
				}, -- [1]
				{
					["Type"] = "trigger",
					["Icon"] = "Interface\\Icons\\Ability_Warrior_Bladestorm",
					["Name"] = "AoE",
				}, -- [2]
				{
					["Type"] = "trigger",
					["Icon"] = 132362,
					["Name"] = "Def",
				}, -- [3]
				{
					["Type"] = "selector",
					["Name"] = "Interrupt",
					["Values"] = {
						{
							["Value"] = "first",
							["Icon"] = 876914,
						}, -- [1]
						{
							["Value"] = "mid",
							["Icon"] = 876916,
						}, -- [2]
						{
							["Value"] = "last",
							["Icon"] = 876915,
							["default"] = 1,
						}, -- [3]
					},
				}, -- [4]
			},
			["Id"] = 1,
			["Spells"] = {
				["Порыв нефритового ветра"] = 116847,
				["Отвар железной шкуры"] = 115308,
				["Рука-копье"] = 116705,
				["Удар бочонком"] = 121253,
				["Круговой удар ногой"] = 119381,
				["Лапа тигра"] = 100780,
				["Нокаутирующая атака"] = 205523,
				["Пламенное дыхание"] = 115181,
				["Целебный эликсир"] = 122281,
				["Защита"] = 115295,
				["Призыв статуи Черного Быка"] = 115315,
				["Сверкающая нефритовая молния"] = 117952,
				["Детоксикация"] = 218164,
				["Очищающий отвар"] = 119582,
			},
			["Buffs"] = {
				["Легкое пошатывание"] = 124275,
				["Умеренное пошатывание"] = 124274,
				["Сильное пошатывание"] = 124273,
				["Верткий задира"] = 195630,
				["Знак битвы"] = 186403,
				["Глаз тигра"] = 196608,
				["Таинственное прикосновение"] = 113746,
				["Отвар железной шкуры"] = 215479,
			},
			["Class"] = "MONK",
		}



function bot:OnUpdate(g, list, modes)
	if IsMounted() then return end
	if modes.toggle.Stop then
		return
	end

	list:Cast( "Рука-копье", g.target:CanUse("Рука-копье"):CanInterrupt():Best() )
	list:Cast( "Детоксикация", g.player:CanUse("Детоксикация"):NeedDecurse("Poison","Disease"):MinHP() )

	if g.player:AffectingCombat(true):MinHP() then
		list:Cast( "Отвар железной шкуры", g.player:CanUse("Отвар железной шкуры"):Talent("Упрощенное варение", false):Charges("Отвар железной шкуры", 3, 6):Aura("Отвар железной шкуры", "mine", "self", "inverse"):Best() )
		list:Cast( "Отвар железной шкуры", g.player:CanUse("Отвар железной шкуры"):Talent("Упрощенное варение", true):Charges("Отвар железной шкуры", 4, 6):Aura("Отвар железной шкуры", "mine", "self", "inverse"):Best() )

		list:Cast( "Целебный эликсир", g.player:CanUse("Целебный эликсир"):Charges("Целебный эликсир", 2, 3):HP("<", 70, "self"):Best() )
		list:Cast( "Целебный эликсир", g.player:CanUse("Целебный эликсир"):Charges("Целебный эликсир", 1):HP("<", 50, "self"):Best() )
		--list:Cast( "Очищающий отвар", g.player:CanUse("Очищающий отвар"):Aura( "Умеренное пошатывание", "mine", "self"):Best() )
		list:Cast( "Очищающий отвар", g.player:CanUse("Очищающий отвар"):Aura( "Сильное пошатывание", "mine", "self"):Best() )
		list:Cast( "Защита", g.player:CanUse("Защита"):Aura( "Сильное пошатывание", "mine", "self"):Best() )
	end

	list:Cast( "Удар бочонком", g.target:CanUse("Удар бочонком"):Best() )
	list:Cast( "Пламенное дыхание", g.target:CanUse("Пламенное дыхание"):InSpellRange("Нокаутирующая атака"):Best() )
	list:Cast( "Нокаутирующая атака", g.target:CanUse("Нокаутирующая атака"):Best() )
	list:Cast( "Порыв нефритового ветра", g.player:CanUse("Порыв нефритового ветра"):Aura("Порыв нефритового ветра", "mine", "self", "inverse"):Condition(g.target:InSpellRange("Нокаутирующая атака"):Any()):Best() )
	list:Cast( "Лапа тигра", g.target:CanUse("Лапа тигра"):Energy(">",65):Best() )
	return list:Execute()
end


TBRegister(bot)
